問題1

次の条件を満たすCプログラムを、最初から自分で書いてください。

int型の変数に50を保存する
その変数を指すポインタを作る
ポインタを使って、その変数の値を80へ変更する
最後に元の変数をprintfで表示する

出力結果：

80

コードを書いて解答してください。



解答：
#include <stdio.h>

int main(void)
{
  int number = 50;
  int *p = &number;

  *p = 80;

  printf("%d\n", *p);

  return 0;
}

------------------------

解答：
#include <stdio.h>

int main(void)
{
  int number = 50;
  int *p = &number;

  *p = 80;

  printf("%d\n", number);

  return 0;
}



============================================================================================


問題2

次の条件を満たすプログラムを書いてください。

int型のポインタを宣言する
最初はNULLを代入する
if文を使って、ポインタがNULLか確認する
NULLなら NO ADDRESS と表示する

出力結果：

NO ADDRESS

コードを書いて解答してください。



解答：
#include <stdio.h>

int main(void)
{
  int *p = NULL;

  if (p == NULL) {
    printf("NO ADDRESS");
  }

  return 0;
}



========================================================================================


問題3です。
次の条件を満たすプログラムを書いてください。
- int型の変数に 40 を保存する
- その変数を指すポインタを作る
- if文で、そのポインタが NULL ではないことを確認する
- NULLではなければ、ポインタを使って元の変数の値を 70 に変更する
- 最後に元の変数を表示する
出力結果：
70

コードを書いて解答してください。



解答：
#include <stdio.h>

int main(void)
{
  int number = 40;

  int *p = &number;

  if (p != NULL) {
    *p = 70;
  }

  printf("%d", number);

  return 0;
}




====================================================================================


問題4です。
次のコードには危険な点があります。
#include <stdio.h>

int main(void)
{
    int *p;

    *p = 100;

    printf("%d\n", *p);

    return 0;
}

危険な理由を、自分の言葉で説明してください。



解答：
/* p = ポインタに&〇〇の値を保存する有効なメモリアドレスがない。指定されていない中で値を入れているから危ない */



======================================================================================


問題5です。
次のコードを安全なコードに修正してください。
#include <stdio.h>

int main(void)
{
    int *p = NULL;

    *p = 50;

    printf("%d\n", *p);

    return 0;
}

条件：
- int型の変数を1つ作る
- p にその変数のメモリアドレスを入れる
- p が NULL ではないことを確認してから *p = 50; を実行する
- 最後に元の変数の値を表示する



解答：
いけない点はp = ポインタに入る&〇〇のメモリアドレスが無いうえで、値を入れているから。


#include <stdio.h>

int main(void)
{
  int number = NULL;
  int *p = &number;

  if (p !== NULL) {
    *p = 50;
  }

  printf("%d\n", number);

  return 0;
}

---------------------------

解答：
いけない点はp = ポインタに入る&〇〇のメモリアドレスが無いうえで、値を入れているから。

#include <stdio.h>

int main(void)
{
  int number = 0;
  int *p = &number;

  if (p != NULL) {
    *p = 50;
  }

  printf("%d\n", number);

  return 0;
}



=======================================================================================


問題6です。
次の2つの違いを、自分の言葉で説明してください。

int *p;

int *p = NULL;


見るポイントは、
- p の中身がどういう状態か
- どちらが安全か
- そのまま *p を使ってよいか
です。



解答：

どういう状態か。
int *pはポインタが未初期化である。指し先が分からない。
int *p = NULL;はポインタがNULL = 指し先であるメモリアドレスがないという事。

どちらが安全か
int *pは何が入っているか不明である。それに比べてint *p = NULLはNULLという指し先がないという事が入っているから。分かるからまだ安全である。

そのまま *p を使ってよいか
int *pは指し先が不明であるからダメ。
int *p = NULLはメモリアドレスの指し先がないのでダメ。



=======================================================================================



次の4つについて、安全か危険かを答えてください。危険なものは理由も書いてください。
①
int number = 10;
int *p = &number;
printf("%d\n", *p);

②
int *p = NULL;
printf("%d\n", *p);

③
int *p;
*p = 20;

④
int number = 10;
int *p = &number;

if (p != NULL) {
    *p = 20;
}

①〜④をそれぞれ答えてください。



解答：
1はいいと思います。

2は危険であると思います。int *p = NULLでメモリアドレスの指し先がないのに%dで*pで指し先がある前提で値を出そうとしているから、予想できない動きをしてしまう可能性に繋がりだめである。

3も未初期化のpで、メモリアドレス、値など中身に何があるか不明な中に20を代入してしまっているため、予想できない動きをしてしまう可能性に繋がりだめである。

4はいいと思います。number=10にして、&numberがnumberのメモリアドレスで、それをpにいれ、pがポインタ。で*pに入ったメモリアドレスにある値のnumber=10が入ると。で、そこからNULLじゃなければ20を代入という事で。そのままできると思います。



=======================================================================================



最終問題
次の条件を満たすプログラムを書いてください。
- int型の変数 number を 25 で初期化
- int型を指すポインタ p を NULL で初期化
- p に number のメモリアドレスを代入
- p が NULL ではないことを確認
- NULLでなければ、*p を使って number を 100 に変更
- 最後に number を表示
出力：
100

さらにコードの下に、次の3つを自分の言葉で説明してください。
1. p は何を表しているか
2. *p は何を表しているか
3. なぜ p != NULL を確認してから *p を使うのか
コードのヒントは出しません。



解答：
#include <stdio.h>

int main(void)
{
  int number = 25;
  int *p = NULL;

  int *p = &number;

  if (p != NULL) {
    *p = 100;
  }

  printf("%d\n", number);

  return 0;
}

1. p は何を表しているか
pはポインタである。int numberの変数のメモリアドレスを保存してある&〇〇を代入したものである。

2. *p は何を表しているか
numberの値を表している。

3. なぜ p != NULL を確認してから *p を使うのか
指し先が不明であると触ると予想できない動きをしてしまうし、わからない

------------------------------------------------



解答：
#include <stdio.h>

int main(void)
{
  int number = 25;
  int *p = NULL;

  p = &number;

  if (p != NULL) {
    *p = 100;
  }

  printf("%d\n", number);

  return 0;
}

1. p は何を表しているか
pはポインタである。int numberの変数のメモリアドレスを保存してある&〇〇を代入したものである。

2. *p は何を表しているか
numberの値を表している。

3. なぜ p != NULL を確認してから *p を使うのか
指し先がNULLのまま値を入れてしまうと予想できない動きをしてしまうから、ちゃんと変数に対してのメモリアドレスの指し先があるか確認して、変数に値を入れる